#### VD 25

# Pandas

## 1) Pandas Series

- Pandas Series is one dimentional
- A pandas series is like a column in a table

#### **1.1)  Pandas Series can Be created using**

In [1]:
import numpy as np
import pandas as pd

In [2]:
l = [10,20,30]
type(l)

list

In [3]:
a = np.array(l)
print(a)
type(a)

[10 20 30]

numpy.ndarray

In [4]:
# Now we are going to convert it into the Pandas Series
a = pd.Series(l)
a

0    10
1    20
2    30
dtype: int64

In [5]:
type(a)

pandas.core.series.Series

In [6]:
a+10

0    20
1    30
2    40
dtype: int64

In [7]:
# We can also give name to its indexs
s = pd.Series(l,index = ['a','b','c'])
s

a    10
b    20
c    30
dtype: int64

In [8]:
# Another way for indexing
s = pd.Series(l,index = range(len(l)))
s

0    10
1    20
2    30
dtype: int64

#### **1.2)  Create Pandas Series using 1D Array**

In [9]:
a = np.array([10,20,30])
s = pd.Series(a)
s

0    10
1    20
2    30
dtype: int64

In [10]:
s = pd.Series(a,index = ['a','b','c'])
s

a    10
b    20
c    30
dtype: int64

#### **1.3)  Create Pandas Series using 1D Array**

In [11]:
d = {'a':[10,20,30],'b':20,'c' :30}
pd.Series(d)

a    [10, 20, 30]
b              20
c              30
dtype: object



## 2) Pandas DataFrame

- A pandas DataFrame is a 2D data structure, like a 2D array or a table with rows and column.

#### **2.1)  Create Pandas Data Frame using Dictionary**

In [12]:
d = {'col':[1,2],'col2':[3,4]}
pd.Series(d)

col     [1, 2]
col2    [3, 4]
dtype: object

In [13]:
df = pd.DataFrame(d)
df

   col  col2
0    1     3
1    2     4

In [14]:
print(type(df))
df.shape

<class 'pandas.core.frame.DataFrame'>

(2, 2)

In [15]:
# Example 2
d = {"Age":[22,23,25,24,26],
    "Salary": [170000,150000,250000,350000,460000],
    "Gender": ["M","F","M","M","F"]}
df = pd.DataFrame(d)
df

   Age  Salary Gender
0   22  170000      M
1   23  150000      F
2   25  250000      M
3   24  350000      M
4   26  460000      F

#### **2.2)  Create Pandas Data Frame using Nested List**

In [16]:
l = [[1,2,3,4],[4,5,6,8]]
df = pd.DataFrame(l)
df

   0  1  2  3
0  1  2  3  4
1  4  5  6  8

#### **2.3)  Create Pandas Data Frame using 2D Array**

In [17]:
arr_2D = np.array([[1,2,3,4],[4,5,6,8]])
df = pd.DataFrame(arr_2D)
df

   0  1  2  3
0  1  2  3  4
1  4  5  6  8

In [18]:
arr_2D = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
df2 = pd.DataFrame(arr_2D, index=['a', 'b', 'c'], columns=['i', 'j', 'k'])
df2

   i  j  k
a  1  2  3
b  4  5  6
c  7  8  9

#### **2.4) SET Index and Reset Index**

In [19]:
# Example 2
d = {"Age":[22,23,25,24,26],
    "Salary": [170000,150000,250000,350000,460000],
    "Gender": ["M","F","M","M","F"]}
df = pd.DataFrame(d)
df

   Age  Salary Gender
0   22  170000      M
1   23  150000      F
2   25  250000      M
3   24  350000      M
4   26  460000      F

In [20]:
df["sr.no"] = np.arange(1,6)
df

   Age  Salary Gender  sr.no
0   22  170000      M      1
1   23  150000      F      2
2   25  250000      M      3
3   24  350000      M      4
4   26  460000      F      5

In [21]:
# First we have to create variacle to set the index  after we can abe t do that
df1 = df.set_index("sr.no")
df1

       Age  Salary Gender
sr.no
1       22  170000      M
2       23  150000      F
3       25  250000      M
4       24  350000      M
5       26  460000      F

In [24]:
df1.loc[1]

Age           22
Salary    170000
Gender         M
Name: 1, dtype: object

In [25]:
# Now setting the index as age
df1 = df.set_index("Age")
df1.loc[26]

Salary    460000
Gender         F
sr.no          5
Name: 26, dtype: object

In [ ]:
# Now Setting the index srno
df2 = df.set_index("sr.no")
df2

In [ ]:
# According to the object name we can access the rows or colums after setting up the index
df2.loc[3]

In [ ]:
df1.loc[24]

**2.4.1)Reset Index**

In [ ]:
df

In [ ]:
df.reset_index()

#### **2.5) Select/ Extract the required data**

- loc is used for extracting the data based on index name
- iloc is used for extracting the data based on index number

In [ ]:
# Example
d = {"Age":[22,23,25,24,26],
    "Salary": [170000,150000,250000,350000,460000],
    "Gender": ["M","F","M","M","F"]}
df = pd.DataFrame(d)
df

**2.5.1) Extract a single row**

In [28]:
df.iloc[2]

Age           25
Salary    250000
Gender         M
sr.no          3
Name: 2, dtype: object

**2.5.2) Extract a multiple row slicing based**

In [31]:
df.loc[0:4]

   Age  Salary Gender  sr.no
0   22  170000      M      1
1   23  150000      F      2
2   25  250000      M      3
3   24  350000      M      4
4   26  460000      F      5

**2.5.3) Extract a multiple row without slicing**

In [32]:
df.loc[[0,1,4]]

   Age  Salary Gender  sr.no
0   22  170000      M      1
1   23  150000      F      2
4   26  460000      F      5

**2.5.4) Extract a single column**

In [35]:
df.loc[1:,"Age"]

1    23
2    25
3    24
4    26
Name: Age, dtype: int64

**2.5.5) Extract a multiple column slicing based**

In [41]:
df.loc[:,"Age":"Salary"]
# df.iloc[:,0:3]

   Age  Salary
0   22  170000
1   23  150000
2   25  250000
3   24  350000
4   26  460000

**2.5.6)  Extract a multiple column without slicing based**

In [ ]:
df.loc[:,["Age","Gender"]]

**2.5.7)  Extract selected rows and selected columns**

- Syntax - df.loc[rowname , column name]
- df.loc[[multiple row sep by comaa],[multiple column sep by comma]]

In [42]:
df.loc[[1,2],["Age","Gender"]]

   Age Gender
1   23      F
2   25      M

#### **2.6) Select/ Extract the required data Based on index number**

**2.6.1)  Extract single value**

In [43]:
df.iloc[-2,0]

24

**2.6.2)  Extract selected roes with all the columns**

In [44]:
df.loc[[0,4],:]

   Age  Salary Gender  sr.no
0   22  170000      M      1
4   26  460000      F      5

**2.6.1)  Extract selected rows selected columns**

In [45]:
df.iloc[[0,2,4],[0,1]]

   Age  Salary
0   22  170000
2   25  250000
4   26  460000

##### VD 26

#### **2.7) Modify the DataFrames**

In [ ]:
# Example
d = {"Age":[22,23,25,24,26],
    "Salary": [170000,150000,250000,350000,460000],
    "Gender": ["M","F","M","M","F"]}
df = pd.DataFrame(d)
df

**2.7.1) Drop a single row**

In [49]:
df = df.drop(index = [2])
df

KeyError: '[2] not found in axis'

In [47]:
df

   Age  Salary Gender  sr.no
0   22  170000      M      1
1   23  150000      F      2
3   24  350000      M      4
4   26  460000      F      5

In [50]:
df.drop(index = [0],inplace = True)
df

   Age  Salary Gender  sr.no
1   23  150000      F      2
3   24  350000      M      4
4   26  460000      F      5

- In the given line of code, the inplace=True argument means that the changes made to the DataFrame (dropping the specified row) will directly modify the original DataFrame without creating a new one.
  
- If you do not specify inplace=True in the drop() method (or other similar pandas operations), the default behavior is inplace=False. This means the method will not modify the original DataFrame but instead return a new DataFrame with the specified changes.

In [52]:
# Example
d = {"Age":[22,23,25,24,26],
    "Salary": [170000,150000,250000,350000,460000],
    "Gender": ["M","F","M","M","F"]}
df = pd.DataFrame(d)
df

   Age  Salary Gender
0   22  170000      M
1   23  150000      F
2   25  250000      M
3   24  350000      M
4   26  460000      F

**2.7.2) Drop Multiple rows**

In [53]:
df1 = df.drop(index = [0,1,2])
df1

   Age  Salary Gender
3   24  350000      M
4   26  460000      F

**2.7.3) Drop Single Column**

In [ ]:
df

In [54]:
df2 = df.drop(columns = ['Age'])
df2

   Salary Gender
0  170000      M
1  150000      F
2  250000      M
3  350000      M
4  460000      F

**2.7.4) Drop Multiple Columns**

In [ ]:
df3 = df.drop(columns=['Age','Gender'])
df3

#### **2.8)Sorting**

In [ ]:
df

**2.8.1) Sorting in Ascending order**

In [55]:
df.sort_values(by = "Age")

   Age  Salary Gender
0   22  170000      M
1   23  150000      F
3   24  350000      M
2   25  250000      M
4   26  460000      F

**2.8.2) Sorting in Descending order**

In [ ]:
df.sort_values(by = ["Age","Gender"], ascending = False)

#### **2.9)Combining Dataframes**

In [56]:
df1 = pd.DataFrame({"City":["Mumbai","Delhi","Banglore","Hyderabad"],"Temperature":[34,20,40,37]})
df1

        City  Temperature
0     Mumbai           34
1      Delhi           20
2   Banglore           40
3  Hyderabad           37

In [57]:
df2 = pd.DataFrame({"City":["Delhi","Mumbai","Banglore","Hyderabad","Chennai"],"Humidity":[68,56,75,70,45]})
df2

        City  Humidity
0      Delhi        68
1     Mumbai        56
2   Banglore        75
3  Hyderabad        70
4    Chennai        45

**2.9.1) Concatenation of Dataframes**

- axis=0: This means the operation is performed along the rows (vertical concatenation.
- axis=1: This means the operation is performed along the columns (horizontal concatenation).

In [58]:
pd.concat([df1,df2],axis = 1)

        City  Temperature       City  Humidity
0     Mumbai         34.0      Delhi        68
1      Delhi         20.0     Mumbai        56
2   Banglore         40.0   Banglore        75
3  Hyderabad         37.0  Hyderabad        70
4        NaN          NaN    Chennai        45

In [59]:
pd.concat([df1,df2],axis = 0)

        City  Temperature  Humidity
0     Mumbai         34.0       NaN
1      Delhi         20.0       NaN
2   Banglore         40.0       NaN
3  Hyderabad         37.0       NaN
0      Delhi          NaN      68.0
1     Mumbai          NaN      56.0
2   Banglore          NaN      75.0
3  Hyderabad          NaN      70.0
4    Chennai          NaN      45.0

- When ignore_index=True, the index is reset to a continuous sequence (0, 1, 2, 3).

In [60]:
pd.concat([df1,df2],axis = 0,ignore_index = True)

        City  Temperature  Humidity
0     Mumbai         34.0       NaN
1      Delhi         20.0       NaN
2   Banglore         40.0       NaN
3  Hyderabad         37.0       NaN
4      Delhi          NaN      68.0
5     Mumbai          NaN      56.0
6   Banglore          NaN      75.0
7  Hyderabad          NaN      70.0
8    Chennai          NaN      45.0

**2.9.2) Merging of Dataframes**

In [ ]:
df1

In [ ]:
df2

**1)Left Join**

In [61]:
pd.merge(df1,df2,on ="City",how= "left")

        City  Temperature  Humidity
0     Mumbai           34        56
1      Delhi           20        68
2   Banglore           40        75
3  Hyderabad           37        70

**2)Right Join**

In [62]:
pd.merge(df1,df2,on ="City",how= "right")

        City  Temperature  Humidity
0      Delhi         20.0        68
1     Mumbai         34.0        56
2   Banglore         40.0        75
3  Hyderabad         37.0        70
4    Chennai          NaN        45

**3)Inner Join**

In [63]:
pd.merge(df1,df2,on ="City",how= "inner")

        City  Temperature  Humidity
0     Mumbai           34        56
1      Delhi           20        68
2   Banglore           40        75
3  Hyderabad           37        70

**4)Outer Join**

In [64]:
pd.merge(df1,df2,on ="City",how= "outer")

        City  Temperature  Humidity
0   Banglore         40.0        75
1    Chennai          NaN        45
2      Delhi         20.0        68
3  Hyderabad         37.0        70
4     Mumbai         34.0        56